Repository: pquoctam/DoAnCuoiKy
Catalog: Resources/Views/Home/About.*.resx
Languages: vi

# PageTitle
source: ABOUT TEXAS CHICKEN
vi: VỀ TEXAS CHICKEN

# IntroHeading
source: INTRODUCTION
vi: GIỚI THIỆU

# BrandParagraph1
source: Founded in San Antonio, Texas (USA) in 1952, Texas Chicken is one of the world’s leading fast food service brands. Today, Texas Chicken is a top international fried chicken brand, serving over 3 million guests weekly at more than 1,700 restaurants in the USA and 26 other countries around the world.
vi: Được thành lập tại thành phố San Antonio, bang Texas (Mỹ) năm 1952, Texas Chicken là một trong những thương hiệu hàng đầu thế giới về ngành dịch vụ ăn nhanh. Texas Chicken hiện là thương hiệu quốc tế hàng đầu về gà rán, phục vụ trên 3 triệu quý khách mỗi tuần trên toàn hệ thống 1.700 tiệm tại Mỹ và 26 quốc gia.

# BrandParagraph2
source: Texas Chicken is committed to using only the freshest, highest-quality chicken – never frozen. All dishes are freshly prepared every day and served hot and crispy to satisfy every guest.
vi: Thương hiệu Texas Chicken cam kết chỉ sử dụng gà tươi, chất lượng cao, không dùng thực phẩm đông lạnh. Các món ăn luôn được chế biến trong ngày và phục vụ nóng hổi, giòn tan đến tay thực khách.

# BrandParagraph3
source: Entering the Vietnamese market in late 2012, Texas Chicken has rapidly expanded with 30 restaurants in Ho Chi Minh City, Binh Duong, Nha Trang, Hanoi, Hai Phong, and Bien Hoa, attracting many customers to experience its flavorful and bold “Texas-style” fried chicken.
vi: Texas Chicken có mặt tại Việt Nam từ cuối năm 2012 và đã phát triển nhanh chóng với 30 nhà hàng tại TP.HCM, Bình Dương, Nha Trang, Hà Nội, Hải Phòng và Biên Hòa, mang đến trải nghiệm "Gà rán đậm vị Texas" cho nhiều thực khách.

# TimelineIntro
source: HOW IT ALL STARTED
vi: TẤT CẢ BẮT ĐẦU NHƯ THẾ NÀO

# Timeline1950_1
source: His name was George W. Church, Sr., and he is the reason you crave chicken so much...
vi: Ông ấy tên là George W. Church, Sr. và ông ấy là lý do khiến bạn thèm ăn thịt gà đến vậy...

# Timeline1950_2
source: George W. Church, Sr. opened Church's Fried Chicken-To-Go in downtown San Antonio...
vi: George W. Church, Sr. mở Church’s Fried Chicken-To-Go ở trung tâm San Antonio...

# Timeline1950_3
source: Churchie™ became the adorable mascot of the brand.
vi: Churchie™ trở thành linh vật đáng yêu của thương hiệu.

# Timeline1960_1
source: Church's® had over 100 restaurants across seven states.
vi: Church’s ® có hơn 100 nhà hàng ở bảy tiểu bang

# Timeline1960_2
source: George W. (Bill) Church, Jr. took over the company after his father's passing.
vi: George W. (Bill) Church, Jr tiếp quản công ty sau khi cha anh qua đời.

# Timeline1960_3
source: Church's® became a public company. The National Headquarters complex opened in San Antonio, Texas.
vi: Church’s ® trở thành công ty đại chúng. Trụ sở Quốc gia mở tại San Antonio.

# Timeline1970_1
source: Our restaurants got a brand new look.
vi: Nhà hàng của chúng tôi có một diện mạo mới.

# Timeline1970_2
source: The first Church's® franchise outside the U.S. opened in Vancouver, Canada.
vi: Franchise đầu tiên của Church’s ® mở bên ngoài Hoa Kỳ tại Vancouver, Canada.

# Timeline1970_3
source: Church's® was listed on the NYSE. The Wall Street Journal called Church's® "the best-managed growth company nationwide."
vi: Church’s ® niêm yết trên sàn chứng khoán NY. Tạp chí Wall Street gọi là “công ty tăng trưởng được quản lý tốt nhất”.

# Timeline1970_4
source: A new ad campaign clearly distinguished Church's® from competitors.
vi: Chiến dịch quảng cáo mới giúp Church’s ® nổi bật giữa các đối thủ.

# Timeline1980_1
source: A new advertising campaign was launched to tackle competition. The "Kick the Bucket" slogan went head-to-head with another chicken chain.
vi: Chiến dịch "Kick the Bucket" cạnh tranh trực tiếp với chuỗi gà khác.

# Timeline1980_2
source: Church's® underwent another upgrade with new brand colors: green, white, and orange.
vi: Church’s ® đổi diện mạo. Màu sắc mới: xanh lá, trắng và cam.

# Timeline1980_3
source: The brand-new Big Chicken Sandwich set a company record – nearly 1,400 sold in one day!
vi: Bánh mì kẹp Big Chicken mới lập kỷ lục: gần 1.400 chiếc bán ra trong một ngày.

# Timeline1990_1
source: We lived and believed in our true heritage – the Texas Way.
vi: Chúng tôi sống và tin vào di sản đích thực: Con đường Texas.

# Timeline1990_2
source: AFC, the new parent company of Church's Chicken®, relocated Church's® headquarters to Atlanta, Georgia.
vi: AFC trở thành công ty mẹ, chuyển trụ sở về Atlanta, Georgia.

# Timeline1990_3
source: After 12 years with AFC, Church's® was acquired by a private equity firm and no longer affiliated with any other brand.
vi: Sau 12 năm, Church’s® được bán lại cho công ty cổ phần tư nhân và không còn liên kết với thương hiệu khác.

# Timeline2000_1
source: Global sales surpassed 1,000,000,000. That’s a lot of chicken!
vi: Doanh số toàn cầu vượt 1 tỷ USD – một lượng gà khổng lồ!

# Timeline2000_2
source: Over 60 years, Church's® has seen many rebrands, new products, and campaigns. But one thing hasn’t changed: we still serve the world’s best fried chicken!
vi: Suốt hơn 60 năm, Church’s® thay đổi nhiều diện mạo, sản phẩm, chiến dịch, nhưng luôn giữ chất lượng gà hàng đầu.

# Timeline2010_1
source: Our tradition is Texas. And it’s yours to savor. Every day, every bite.
vi: Truyền thống của chúng tôi là Texas – dành cho bạn thưởng thức mỗi ngày.

# Timeline2010_2
source: Serving customers at more than 1,700 locations in 23 countries worldwide.
vi: Phục vụ hơn 1.700 địa điểm tại 23 quốc gia.

# Timeline2010_3
source: Opened Texas Chicken restaurants in Malaysia.
vi: Khai trương nhà hàng Texas Chicken tại Malaysia.

# Timeline2020_1
source: With legendary meals, handcrafted flavors, and unforgettable experiences for our guests.
vi: Bữa ăn thủ công huyền thoại với hương vị đậm đà mang đến trải nghiệm đáng nhớ.

# Timeline2020_2
source: Our legacy, spirit, and roots are truly Texan.
vi: Di sản, tinh thần và cội nguồn của chúng tôi đều đến từ Texas.

# Timeline2020_3
source: Texas Chicken officially launched in Vietnam.
vi: Khai trương nhà hàng Texas Chicken tại Việt Nam.
